# -*- coding: utf-8 -*-
"""
Задание 7.2b

Переделать скрипт из задания 7.2a: вместо вывода на стандартный поток вывода,
скрипт должен записать полученные строки в файл

Имена файлов нужно передавать как аргументы скрипту:
 * имя исходного файла конфигурации
 * имя итогового файла конфигурации

При этом, должны быть отфильтрованы строки, которые содержатся в списке ignore
и строки, которые начинаются на '!'.

Ограничение: Все задания надо выполнять используя только пройденные темы.

"""


ignore = ["duplex", "alias", "configuration", "!"]
from sys import argv
with open(argv[1]) as come_in, open(argv[2], 'a') as come_out:
#with open('config_sw1.txt') as f:
    for line in come_in:
        for word in ignore:
            if word in line:
                break
        else:
            come_out.write(line)